#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>



//
//#define FIVE 5
//int main(void)
//
//{
	//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果
	//	A选手说：B第二，我第三；
	//	B选手说：我第二，E第四；
	//	C选手说：我第一，D第二；
	//	D选手说：C最后，我第三；
	//	E选手说：我第四，A第一；
	//	比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。
//
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	int d = 0;
//	int e = 0;
//	for (a = 1; a <= FIVE; a++)
//	{
//		
//		for (b = 1; b <= FIVE; b++)
//		{
//			for (c = 1; c <= FIVE; c++)
//			{
//				for (d = 1; d <= FIVE; d++)
//				{
//					for (e = 1; e <= FIVE; e++)
//					{
//						if ((a == 3) + (b == 2) == 1
//							&& (b == 2) + (e == 4) == 1
//							&& (c == 1) + (d == 2) == 1
//							&& (c == 5) + (d == 3) == 1
//							&& (e == 4) + (a == 1))
//						{
//							if (a * b * c * d * e == 120)
//							{
//								printf("a = %d\n", a);
//								printf("b = %d\n", b);
//								printf("c = %d\n", c);
//								printf("d = %d\n", d);
//								printf("e = %d\n", e);
//
//
//							}
//
//						}
//
//
//
//
//					}
//
//
//				}
//
//
//			}
//
//
//
//		}
//
//
//
//
//
//	}
//
//
//
//
//
//	return 0;
//}

	//2.
	//	日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个
	//	嫌疑犯的一个。以下为4个嫌疑犯的供词。
	//	A说：不是我。
	//	B说：是C。
	//	C说：是D。
	//	D说：C在胡说
	//	已知3个人说了真话，1个人说的是假话。
	//	现在请根据这些信息，写一个程序来确定到底谁是凶手。

//
//int main(void)
//{
//	char kill;
//	for (kill = 'A'; kill <= 'D'; kill++)
//	{
//		if ((kill != 'A') + (kill == 'C') + (kill == 'D') + (kill != 'D') == 3)
//		{
//			printf("%c ", kill);
//
//
//
//		}
//
//
//	}
//}
//


////
////3.在屏幕上打印杨辉三角。
////1
////1 1
////1 2 1
////1 3 3 1
//////
//
//int main(void)
//
//
//{
//	int i = 0;
//	int j = 0;
//	int k = 10;
//	int yanghui[10][10] = { 0 };
//
//	for (i = 0; i < 10; i++)
//	{
//		yanghui[i][j] = 1;
//
//		yanghui[i][i] = 1;
//
//	}
//
//	for (i = 2; i < 10; i++)
//	{
//		for (j = 1; j < i; j++)
//		{
//			yanghui[i][j] = yanghui[i-1][j] + yanghui[i - 1][j - 1];
//
//
//		}
//
//
//	}
//	
//	for (i = 0; i < 10; i++)
//	{
//		for (k = 10-i; k > 0; k--)
//		{
//			printf("  ");
//
//		}
//		for (j = 0; j <= i; j++)
//		{
//			printf("%4d", yanghui[i][j]);
//		}
//		printf("\n");
//
//	}
//
//}
//
//



















